app/controllers/home_controller.rb

SELECT "lists".* FROM "lists" WHERE (user_id=1) ORDER BY name
SELECT "lists".* FROM "lists" WHERE (users_id = 'bzoon')
SELECT COUNT(*) FROM "list_words" WHERE "list_words"."list_id" = 2
---
  def index
    @list_names = {}
    @list_counts = {}
    lists = List.where("user_id=#{@logged_uid}").order('name')
    lists.each do |list|
      @list_names[list.id] = list.name
      count = ListWord.where(:list_id => list.id).count

INSERT INTO "lists" ("name", "user_id") VALUES (?, ?)  [["name", "test list"], ["user_id", 1]]
---
  def new
    name = params[:name].strip
    List.create(user_id: @logged_uid, name: name)

SELECT "lists".* FROM "lists" WHERE "lists"."id" = 1 ORDER BY "lists"."id" ASC LIMIT 1
UPDATE "lists" SET "name" = ? WHERE "lists"."id" = 1  [["name", "ab"]]
---
  def edit
    id = params[:id]
    list = List.where(:id => id).first
    list.name = params[:name]
    list.save

DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 3]]
SELECT "lists".* FROM "lists" WHERE "lists"."id" = 3
---
  def delete
    id = params[:id]
    List.where(:id => id).destroy_all