app/controllers/list_controller.rb

SELECT "lists".* FROM "lists" WHERE (id=2) ORDER BY "lists"."id" ASC LIMIT 1
SELECT "words".* FROM "words" WHERE (list_id=2) ORDER BY word
---
  def index
    id = params[:id]
    list = List.find(id)
    list_words = list.list_words.includes(:word, :listword_defs)

SELECT "list_words".* FROM "list_words" WHERE "list_words"."list_id" = 2 AND "list_words"."word_id" = 1
DELETE FROM "list_words" WHERE "list_words"."id" = ?  [["id", 1]]
---
  def delete
    id = params[:id]
    word_id = params[:wid]
    #Word.find(word_id).destroy
    lw = ListWord.where(:list_id => id, :word_id => word_id)
    ListwordDef.where(list_word_id: lw[0].id).destroy_all

SELECT "list_words".* FROM "list_words" WHERE "list_words"."list_id" = 2 AND "list_words"."word_id" = 125
SELECT "words".* FROM "words" WHERE "words"."word" = 'to'
INSERT INTO "list_words" ("list_id", "word_id") VALUES (?, ?)  [["list_id", 2], ["word_id", 48]]
INSERT INTO "words" ("definition", "first_def", "list_id", "word") VALUES (?, ?, ?, ?)  [["definition", ""], ["first_def", "a person who puts on a false appearance of virtue or religion"], ["list_id", 2], ["word", "hi"]]
---
  def load_vocab_defs
    id = params[:id]
    word_id = params[:wid]
    word = Word.find(word_id).word
    data = Nokogiri::HTML(open("https://www.vocabulary.com/dictionary/#{URI::escape(word)}"))
    list_word = ListWord.where(list_id: id, word_id: word_id).first
    list_word.listword_defs.destroy_all
    data.css('h3.definition').each do |node|
      defi = node.children().last.text.strip
      ListwordDef.create(list_word_id: list_word.id, definition: defi)