app/controllers/login_controller.rb

  def login
    uname = params[:uname].strip
    passw = params[:passw].strip

    user = User.where("username = '#{uname}' and password = '#{passw}'")
---
SELECT "users".* FROM "users" WHERE (username = 'zoon' and password = 'astron')

  def register
    uname = params[:uname].strip
    passw = params[:passw].strip

    user = User.where("username = '#{uname}'")
    if (user.length != 0)
      @error_mess = "Username already taken."
      render 'index' and return
    end

    user = User.create(username: uname, password: passw)
---
SELECT "users".* FROM "users" WHERE (username = 'zoonb')
INSERT INTO "users" ("password", "username") VALUES (?, ?)  [["password", "astron"], ["username", "zoonb"]]