app/views/list/index.html.erb

    <br>
    <span class="list_ln2"><%= link_to @list.author, user_path(@list.author) %> - <%= pluralize(@list.count, 'word') %></span>
---
SELECT "words".* FROM "words" WHERE (list_id=2) ORDER BY word